embenix/ESP32-P4-DSI-Support-Hub/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

# Support all ESP32-P4 chip revisions (v1.0 and above)
# This ensures compatibility with early revision boards like Olimex ESP32-P4-DevKit (v1.0)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_FULL=0
CONFIG_ESP_REV_MIN_FULL=0

# Disable RTC fast memory as heap to avoid linker issues with non-contiguous regions (ESP-IDF v6.0)
# CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP is not set

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
# Optimize for performance - change to CONFIG_COMPILER_OPTIMIZATION_SIZE=y to reduce binary size if needed
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set  # Disabled due to IRAM section conflicts in ESP-IDF v6.0
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_USE_IMGFONT=y
# LVGL Demos - Only enable widgets demo to reduce binary size
# Disable other demos to keep binary within partition limits
CONFIG_LV_USE_DEMO_WIDGETS=y
# CONFIG_LV_USE_DEMO_BENCHMARK is not set
# CONFIG_LV_USE_DEMO_RENDER is not set
# CONFIG_LV_USE_DEMO_STRESS is not set
# CONFIG_LV_USE_DEMO_MUSIC is not set
# CONFIG_LV_DEMO_MUSIC_AUTO_PLAY is not set
# CONFIG_LV_USE_DEMO_FLEX_LAYOUT is not set
# CONFIG_LV_USE_DEMO_MULTILANG is not set
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LV_THEME_DEFAULT_DARK=y

# Use newlib instead of picolibc to avoid float ABI mismatch with ESP-IDF v6.0
# (esp-15.2.0_20251204 toolchain). See README troubleshooting for details.
CONFIG_LIBC_NEWLIB=y
# CONFIG_LIBC_PICOLIBC is not set

# Waveshare ESP32-P4-WIFI6-Touch-LCD-3.4C build defaults
# CONFIG_ESPRESSIF_ESP32P4_FUNCTION_EV_BOARD is not set
CONFIG_WAVESHARE_ESP32P4_MODULE_DEVKIT=y
# CONFIG_LUCKFOX_5INCH_DSI_TOUCHSCREEN is not set
CONFIG_WAVESHARE_ESP32P4_WIFI6_TOUCH_LCD_3_4C=y
CONFIG_ESP_I2C_FAST_MODE=n
CONFIG_ESP_I2C_CLK_SPEED_HZ=100000
CONFIG_ESP_I2C_USE_PULLUPS=n
